In [2]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [33]:
data =  pd.read_csv(r"C:\Users\shamaun\Desktop\Datasets\auto-mpg.csv",
                   header=None)

In [34]:
data.head()

      0  1      2      3       4     5   6  7                            8
0  18.0  8  307.0  130.0  3504.0  12.0  70  1  "chevrolet chevelle malibu"
1  15.0  8  350.0  165.0  3693.0  11.5  70  1          "buick skylark 320"
2  18.0  8  318.0  150.0  3436.0  11.0  70  1         "plymouth satellite"
3  16.0  8  304.0  150.0  3433.0  12.0  70  1              "amc rebel sst"
4  17.0  8  302.0  140.0  3449.0  10.5  70  1                "ford torino"

In [35]:
data.columns = ['mpg','cylinders','displacement',
                             'horsepower','weight','acceleration',
                             'model_year','origin','car_name']

In [30]:
data.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,car_name
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,"""chevrolet chevelle malibu"""
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,"""buick skylark 320"""

In [37]:
for i in ['horsepower']:
    data[i].replace('?',data.describe(include='all')[i][2],inplace=True)

In [38]:
for i in ['horsepower']:
    print(sum(data[i]=='?'))

0

In [39]:
data['horsepower'] = data.horsepower.astype(float)

In [42]:
ip = data.drop(['mpg','car_name'],axis=1)
op = data['mpg']

In [43]:
from sklearn.model_selection import train_test_split

In [44]:
x_train,x_test,y_train,y_test = train_test_split(ip,op,test_size=0.2)

In [45]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()
model.fit(x_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [46]:
model.score(x_test,y_test)

0.7651488775492081